semaine5/j2/member-manager-copy--/app/controllers/sessions_controller.rb

  def create
    # sessionParams = params_allowed
    user = User.find_by(email: params[:session][:email].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "test"], ["LIMIT", 1]]